
= 表紙を仕上げて入稿する
著者：ボブのおえかき（@gontobob）

== 表紙が出来上がってきた！喜びはそのまま、まずは確認しよう
デザインが完成し、デザイナーからデータを受け取り、すぐにでも入稿したくなってしまうところですが、その前に最終チェックをすることで、本が完成したあとの「しまった！」を防げます。入稿データ（または確認用データ）PDFを見ながら、以下の項目をチェックしましょう。@<fn>{design_check}

//footnote[design_check][ここで挙げた他、より詳細・専門的なチェック項目も多数存在しますがここでは最低限に絞っています。]

ここにトンボとか塗り足しとかついた入稿前データっぽい画像を入れます

== 物理的な「枠」と「余白」の確認
PDFを開いた際、仕上がりサイズ（B5等）ではなく、「塗り足し（上下左右3mmずつ）」を含めたサイズになっているか確認します。
印刷所で配布されているテンプレートにはガイド線がついていることがほとんどなので、それに従って制作していれば問題なくクリアできるはずです。

 ・塗り足しの確認： 背景の絵や色が、仕上がり線の外側までしっかりとはみ出しているか。
 ・文字の安全圏： 切れてはいけない文字やロゴが、仕上がり線から3〜5mm以上内側に配置されているか。
 ・背幅の厚み： ページ数から算出した背幅と、PDF上の背表紙の幅が一致しているか。

== フォントやエフェクトの「化け」チェック
データ変換時に最も事故が起きやすいポイントです。

 ・フォント： 文字が変な記号に化けたり、別のフォントに置き換わったりしていないか。
 ・エフェクト： ついていたはずのエフェクトが消えてしまっていないか。
 ・画像の欠落： 使用している画像が低解像度（ガビガビ）になったり、消えたりしていないか。

== 万が一の入稿ミス発覚時の、デザイナーへの連絡の取り方
入稿してほっと一息ついたのもつかの間、印刷所から連絡が！内容を確認すると、自分では対応できそうにないトラブルのよう……対応が遅れるとその分印刷作業にも遅れが出て、発行が間に合わなくなる可能性もあります。すぐにデザイナーに連絡しなくちゃ！

 ・★デザイナーが緊急時に対応可能か、スケジュールを入稿前に確認しておく  
印刷所から原稿受付の連絡が届くまで、修正をお願いする可能性がある旨を事前に伝えておくのが良いでしょう。
 ・★トラブルの内容を伝えて、対応してもらう  
内容を端折ったり独自に解釈したりせず、印刷所からのメールをそのまま転送するのが一番伝わりやすいと思います。
 ・★対応が済んだらその旨を報告  
再入稿し、印刷所から返事があったらお礼と対応完了の連絡を忘れずに。  
連絡がないとデザイナーもハラハラしながら待ち続けることになってしまいます。

== そして……ついに本が完成！
おめでとうございます！まずは頑張りが形になったことをめいっぱい喜びましょう！やった〜！！

=== 献本はどうする？
完成本を渡してもよいか、デザイナーに確認すると良いでしょう。郵送やイベント会場で手渡しなど方法はさまざまですが、相手の負担にならないものを選びましょう。

=== 次回もお願いしたい！
今回の表紙がとても素敵だったから、次に本を作る時もお願いしたい！と思うこともあるでしょう。ぜひ、今回のお礼と一緒にその気持ちも伝えてあげてください。そう言われて嬉しくないデザイナーはいないはずです。そして、デザイナーの普段の活動をSNSなどで応援するのも良いですね！

== 実例紹介　〜wiroha × gontobob の表紙制作〜
「Code Polaris Tech Book vol.1」
ここにポラリスの完成表紙画像  
2023年5月1日　技術書典14発行  
B5　120P　表紙フルカラー／本文モノクロ  
助成による女性のための技術コミュニティ「Code Polaris」による合同誌。

=== 表紙作成依頼の前の打診

//embed[latex]{
\talk{wiroha}{5月頭の技術書典で合同誌を出すんだけど、表紙を頼んでもいい？}
\talk{gontobob}{いいよ～。どんな本？}
\talk{wiroha}{Code Polarisっていう女性エンジニアのコミュニティ。写真よりはイラスト系を想像してる。}
\talk{gontobob}{へ〜。かわいい系とか、女性誌みたいなおしゃれ系とかの方向性はある？}
\talk{wiroha}{かわいいと手に取りやすそうでいいよね。B5で100ページぐらいになる予定だから、ゆる〜い系よりはしっかりめでもいいと思う。タイトルは「Code Polaris 会報 vol.1」（仮題）。キャリアとか働き方の話とか技術の話をする予定。}
\talk{gontobob}{了解〜、詳細教えて。}
//}

ここで仕様書、ロゴ素材などが共有される。

=== 仕様を元にアイデア出し

//embed[latex]{
\talk{gontobob}{コミュニティの名前にPolarisって入ってるし、背景を星空にしてみたんだけどどう？（背景、タイトルロゴ、帯部分を入れたイメージを出しながら）}
\talk{wiroha}{いいじゃん！あ、帯のキャッチコピーはこれにしてほしい（キャッチコピーのテキストを共有する）で、下の方に小さく掲載内容を並べてほしい。帯はそれで埋まると思うけど、空いてる真ん中あたりを埋められそうな要素なにかあるかな……？}
\talk{gontobob}{Polarisはこぐま座のα星ってところから連想して、こぐまのキャラクター、ってだけだと特徴つけるの難しいね。}
\talk{wiroha}{こぐま座のしっぽの星なんだ。めっちゃかわいいな！デフォルメの効いたかわいいキャラクターだと親しみやすくていいかも。}
\talk{gontobob}{OK、ちょっと練ってみようか。}
//}

//indepimage[4_polaris_tmp_idea01][][scale=0.4]{
//}

//embed[latex]{
\talk{wiroha}{かわいいこぐまのキャラクター、ってだけだと特徴つけるの難しいね。}
\talk{gontobob}{耳とか胸の模様とか、どこかに星要素入れてみたり？}
\talk{wiroha}{あとは技術系だからパソコン触ってたり本読んでたりするといいかも。}
\talk{gontobob}{うーんうーん……（耳に星がついたクマやしっぽが星になっているクマや柄杓を持ったクマのらくがきを量産しながら）}
//}

//indepimage[4_polaris_tmp_idea02][][scale=0.4]{
//}

//embed[latex]{
\talk{wiroha}{……あ！マフラーの先が星になってるのどうかな？！}
\talk{gontobob}{おっいいね！マフラーの色は希望ある？映えそうなのは赤だけど……}
\talk{wiroha}{コミュニティのイメージカラーからいくと紺かなぁ。}
\talk{gontobob}{なるほど。これでどうだろう。}
//}

//indepimage[4_polaris_rough][][scale=0.8]{
//}

//embed[latex]{
\talk{wiroha}{いいねいいね。裏表紙も表紙から繋げて星空にして、そこに執筆者と目次を入れたいな。ただ、締切まで目次が確定しないかもしれないから、仮テキストは流し込みつつそこまで待っててほしい。}
\talk{gontobob}{了解。}
//}

=== 予期せぬ修正がはいること

//embed[latex]{
\talk{wiroha}{ごめん、執筆者の人数が減っちゃったから目次の内容が最初と変わる！}
\talk{gontobob}{まじか。そしたら行数も変わるから裏表紙のバランス取り直さないとだな……文字サイズとかいじってもいい？}
\talk{wiroha}{お願い〜。あとそれに合わせて帯に載せる内容もちょっと変わるんだけど、今日の19時〆で集約してるからそれまで待って！}
\talk{gontobob}{はーい。じゃあこっちは20時ぐらいから作業できるように準備しとくね。}
//}

=== といったやり取りを繰り返し、表紙データが完成！

//embed[latex]{
\talk{gontobob}{入稿データ一式アップしたよ。万が一入稿不備があったら連絡して。仕事が終わってからだから夕方以降になるけど。}
\talk{wiroha}{了解〜、助かった！}
//}

そして、技術書典14にて「Code Polaris Tech Book vol.1」が発行され、その後発行されたvol.2でもマフラーを巻いたクマのキャラクターが新たなポーズで表紙を飾ることになるのでした。
