= 表紙制作を依頼する

== 私が表紙絵担当に！その時デザイナーの脳内

以下は、表紙制作の依頼を受けたときデザイナーの脳内を巡る想像の一例です。
「技術同人誌か……　参考書みたいなシンプルで洗練されたイメージなのかな？それとも中高生ぐらいから手に取れそうな親しみやすいイメージ？デザインだけでなくイラストも描くならテイストを合わせるのはスムーズだけどその分時間がほしいなあ、そういえばいつが締め切りなんだろう……」などなど。
というわけで、デザイナー視点でこれは最初に知っておきたい！というポイントを挙げてみます。

== あなたに依頼したい！そのとき、デザイナーに伝えるべき情報

=== ①何について書かれた本なのか？

→当たり前ですが、これがないと始まりません。
特に、日頃技術書に触れる機会があまりない立場だと「技術書」と言われてもピンとこない可能性も大です。
「○○の□□というツールについて詳しく書いた本を作りたいんだ」と伝えてもらえるだけで「なるほど、どういうツールなのか調べてみよう」と情報収集を行うこともできるようになります。

=== ②サイズ・ページ数・解像度などの仕様

サイズによって表紙に入れられる情報量が変わったり、本の綴じ方向（技術書は左綴じがほとんどかと思いますが）によっても、デザインの視線誘導の方向を考えたりします。
何より、「B5（182×257mm）のつもりでいたのにA5（148×210mm）でデータを作ってしまった！」といった事故が起きないように、情報共有は必須です。

=== ③スケジュールと納期（ラフ提出、本番提出、入稿）

→個人的一番気になるポイントと言っても過言ではありません。というか、依頼を正式に受ける前に確認しておきたいポイントです。いざお受けしたあとで「じゃあ、明後日入稿したいのでよろしく」と言われては困ってしまうからです。最終締め切りだけでなく、「いつまでに初校（たたき台）を提出してほしいか」「完成までに何度ぐらい修正のやり取りをしたいか」とスケジュール感をすり合わせておくと、お互いに焦ったりする心配が減ると思います。

=== ④自分が担当する業務（イラストのみ、表紙デザインのみ、本文も表紙とテイストを合わせたり目次を入れる等があるなら本文にも関わる必要が出てくる）

→ありがちなすれ違いで、
依頼者「表紙絵を描いてください（文字入れや入稿データ作成まで）」
デザイナー「いいですよ（絵だけ描いて、デザインや入稿データの準備は他の人がやってくれるんだな」
というケースがあります。
このまま話が進むと、入稿直前になって
依頼者「あの、本のタイトルや著者名が入ってないんですが……」
デザイナー「えっ？！それもこちらがやるんですか？！」といった事故が起きます。
「お願いするのは表紙絵とデザイン、入稿データの準備までです」
「デザインは他の人にお願いしている（または自分でやる）ので、イラストのみお願いします」
など、具体的に伝えてもらえるとありがたいです。

== いざ制作！私は何をすればいいか教えてポイント

「ふわっとしてるんで、とりあえずかっこよくお願いします」
「センスに自信がないので、おまかせしちゃっていいですか？」
……と言いたくなってしまうところですが、ここが言語化できるとあなたの思い描いたイメージ通りの表紙が仕上がってくる可能性が格段に上がります。そう、格段に。
特に「あるとめちゃめちゃ助かる〜！」のは手書きのラフイメージ。「この位置にタイトルがあって、こういう見出しを目立つように入れて、イラストは真ん中にバーンと。著者名はこのへんに…」を、書き起こした設計図です。
上手く書かなければいけないという心配はまったくありません。◯や□で範囲を指定して「タイトル」「絵」と書いたり、「笑顔でPCに向かっているメガネの女の子」「春っぽく」など文字で書くだけでOKです。
「テーマカラーは青系です」「ガッツリ真面目な内容です」「子供が手に取りたくなるようなやさしいイメージがいいです」「セリフ付きの挿絵がたくさん入るので、表紙もちょっとコミカルさを入れたいです」などなど。
それでも「あまりピンとこないなぁ」「何も思い浮かばない……」という場合は、「この本で一番目立たせたいのは何？二番目は？三番目は？」を羅列するだけでも全然違います。
「①タイトル　②キャッチコピー　③イラスト　④著者名」
「①イラスト　②タイトル　③著者名　④キャッチコピー」
例を2つ挙げてみましたが、構成要素がこの順大きく〜小さく変わるとしたら、それだけでもかなり違って見えると思いませんか？
伝え方はさまざまですが、ここからデザイナーがあなたの要望を汲み取ってヒアリングや提案を返すことで、さらに一歩理解の進んだデザインを作り上げることができます！

== こういうのが嬉しい！参考資料の出し方

表紙に使用する素材（ロゴや写真、本に関係するキーワードなど）を最初に共有してもらえると、そこからもイメージをふくらませることができるのでありがたいです。
依頼者「サークル名（ポラリス）は北極星をイメージしています」
デザイナー「なるほど……では、表紙イラストにはポラリスをα星にしているこぐま座から連想して、こぐまのキャラクターを起用してみるのはどうでしょう？」など。
また、イメージに近い実際の書籍の画像をイメージとして持ってきてもらえるのもありがたいです。一つだけでなく、近い雰囲気の資料が複数あるとよりイメージが掴みやすくなります。

== ここが聞きたい！修正依頼の伝え方

デザイナーから仕上がってきたイメージが「なんか……思っているものと違うな……？」と感じることはあって当たり前だと思います。
でもそれをどう伝えればいいのかは悩ましいポイントだと思います。
一番わかりやすいのは、ラフと同じようにイメージに赤ペン・ペイントソフト等で◯囲みして「この見出しをもっと大きく」「この要素はイメージと違うので削除」など書いてしまうことです。
ちなみに、修正するときにその理由や根拠がわかると（特に専門外の分野だと）助かります。
「この技術はAndoroid向けなので、りんごマークではなくドロイドくんにしてください」等
ただし、同じところを何度も「やっぱりこれで」「次はこれも見てみたい」「やっぱ前のに戻して」と指示が入ると直す側は大変です。
複数のパターンが見てみたい場合には事前に「こういうデザインとこういうデザインを見比べてみたい」となるべく早い段階で伝えれば、工数も時間も短縮できます。
部分的な修正であれば上記の方法が有効ですが、「全体的にイメージと違っていて作り直してほしい」と思う場合もあるかもしれません。
全体の修正は時間も手間もかかり、締切に間に合わなくなる、追加報酬を支払うなどのリスクがあります。こうなるのは最初のすり合わせの時点でイメージの共有がしきれていなかったことが原因かもしれません。すり合わせを密に行うことでこういった事態を防げるのが一番ですが、万が一起きてしまった場合は面倒でも最初に立ち返ってもう一度イメージのすり合わせを行うのが近道になると思います。

== やり取りの頻度・タイミング

お互いの得意な方法をはじめに相談するのが一番よいかと思います。
「何かあればいつでもすぐに連絡がほしい」「毎日◯日に定期連絡」など。
個人的には「連絡事項があれば毎日○時に連絡します（なければ何もしません）」等決めておくと、五月雨式に修正が飛んできて作業時間を圧迫することも減るのではないかと思います。
入稿直前など、一刻を争う場合はこの限りではないので、状況によりけりです。
