= 表紙を仕上げて入稿する

著者：ボブのおえかき（@gontobob）

== 表紙が出来上がってきた！喜びはそのまま、まずは確認しよう
デザインが完成し、デザイナーからデータを受け取り、すぐにでも入稿したくなってしまうところですが、その前に最終チェックをすることで本が完成したあとの「しまった！」を防げます。入稿データ（または確認用データ）PDFを見ながら、次の項目をチェックしましょう。@<fn>{design_check}

//footnote[design_check][ここで挙げた他、より詳細・専門的なチェック項目も多数存在しますがここでは最低限に絞っています。]

//indepimage[3_tori_vtuber_cover_paper][][scale=0.7]{
//}

== 物理的な「枠」と「余白」の確認
PDFを開いた際、仕上がりサイズ（B5等）ではなく、「塗り足し（上下左右3mmずつ）」を含めたサイズになっているか確認します。
印刷所で配布されているテンプレートにはガイド線がついていることがほとんどなので、それに従って制作していれば問題なくクリアできるはずです。

 * 塗り足しの確認：背景の絵や色が、仕上がり線の外側までしっかりとはみ出しているか。
 * 文字の安全圏：切れてはいけない文字やロゴが、仕上がり線から3〜5mm以上内側に配置されているか。
 * 背幅の厚み：ページ数から算出した背幅と、PDF上の背表紙の幅が一致しているか。

== フォントやエフェクトの「化け」チェック
データ変換時に最も事故が起きやすいポイントです。

 * フォント：文字が変な記号に化けたり、別のフォントに置き換わったりしていないか。
 * エフェクト：ついていたはずのエフェクトが消えてしまっていないか。
 * 画像の欠落：使用している画像が低解像度（ガビガビ）になったり、消えたりしていないか。

== 万が一の入稿ミス発覚時の、デザイナーへの連絡の取り方
入稿してほっと一息ついたのもつかの間、印刷所から連絡が！内容を確認すると、自分では対応できそうにないトラブルのよう……対応が遅れるとその分印刷作業にも遅れが出て、発行が間に合わなくなる可能性もあります。すぐにデザイナーに連絡しなくちゃ！

 * デザイナーが緊急時に対応可能か、スケジュールを入稿前に確認しておく  

印刷所から原稿受付の連絡が届くまで、修正をお願いする可能性がある旨を事前に伝えておくのが良いでしょう。

 * トラブルの内容を伝えて、対応してもらう  

内容を端折ったり独自に解釈したりせず、印刷所からのメールをそのまま転送するのが一番伝わりやすいと思います。

 * 対応が済んだらその旨を報告  

再入稿し、印刷所から返事があったらお礼と対応完了の連絡を忘れずに行いましょう。  
連絡がないとデザイナーもハラハラしながら待ち続けることになってしまいます。

== そして……ついに本が完成！
おめでとうございます！まずは頑張りが形になったことをめいっぱい喜びましょう！やった〜！！

=== 献本はどうする？
完成本を渡してもよいか、デザイナーに確認すると良いでしょう。郵送やイベント会場で手渡しなど方法はさまざまですが、相手の負担にならないものを選びましょう。

=== 次回もお願いしたい！
今回の表紙がとても素敵だったから、次に本を作る時もお願いしたい！と思うこともあるでしょう。ぜひ、今回のお礼と一緒にその気持ちも伝えてあげてください。そう言われて嬉しくないデザイナーはいないはずです。そして、デザイナーの普段の活動をSNSなどで応援するのも良いですね！
