= 表紙を仕上げて入稿する

著者：ボブのおえかき（@gontobob）

== 私たちはこうして表紙を作り上げました

第3章、第4章で説明した内容についてより具体的な想像を膨らませられるよう、実際に過去に表紙イラストとデザインを制作した時のwirohaとのDiscordでのやりとりを紹介します。技術書典14で「Code Polaris Tech Book vol.1」を作ったときのものです。身内ゆえに会話はゆるいですが、打ち合わせの内容は流れに沿って進めています。

=== 表紙作成依頼の前の打診

//embed[latex]{
\talk{wiroha}{5月頭の技術書典で合同誌を出すんだけど、表紙を頼んでもいい？}
\talk{gontobob}{いいよ～。どんな本？}
\talk{wiroha}{Code Polarisっていう女性エンジニアのコミュニティ。写真よりはイラスト系を想像してる。}
\talk{gontobob}{へ〜。かわいい系とか、女性誌みたいなおしゃれ系とかの方向性はある？}
\talk{wiroha}{かわいいと手に取りやすそうでいいよね。B5で100ページぐらいになる予定だから、ゆる〜い系よりはしっかりめでもいいと思う。タイトルは「Code Polaris 会報 vol.1」（仮題）。キャリアとか働き方の話とか技術の話をする予定。}
\talk{gontobob}{了解〜、詳細教えて。}
//}

ここで仕様書、ロゴ素材などが共有されます。

//table[spec][仕様書]{
企画概要 @<br>{} 　 @<br>{} 　	コミュニティ「Code Polaris」による合同誌 @<br>{} https://code-polaris.connpass.com/ @<br>{} 女性による女性のための技術コミュニティ。北極星をモチーフにしている。
書籍概要	タイトル：Code Polaris 会報 vol.1 Code Polaris Tech Book
スケジュール @<br>{} 　 @<br>{} 　 @<br>{} 　	4/23(日) 原稿の初稿締切 ※ここでおおよそのページ数がわかる @<br>{} 5/2(火) ★★★入稿予定日★★★ @<br>{} 5/8(月) 予備日 @<br>{} 5/21(日) オフライン開催当日
タイトル一覧 @<br>{} （順番未確定）	・＜タイトル＞／＜著者名＞／＜ページ数＞／＜掲載順＞ @<br>{} ・…
表紙下部テキスト案 @<br>{} 　 @<br>{} 　	コミュニティによる合同誌創刊！ @<br>{} Python、TypeScript、Java、GitHub、リリース、 @<br>{} 転職活動、キャリアアドバイス、技術広報　他
裏表紙	現状、案はない
印刷プラン @<br>{} 　 @<br>{} 　	https://www.nikko-pc.com/site/service/service-off-02/ @<br>{} PP貼りで、キラキラオプションつけてもいいよなーと @<br>{} 思っている。北極星がモチーフのコミュニティなので。
テンプレート @<br>{} 　 @<br>{} 　	https://www.nikko-pc.com/site/home-hd-2/home-tombo/ @<br>{} フルカラー表紙 B5 @<br>{} 紙の種類は決まってないのでおすすめがあれば。
コミュニティロゴ	別途メールで送信済み
入稿時に必要な情報 @<br>{} 　 @<br>{} 　 @<br>{} 　 @<br>{} 　 @<br>{} 　	入稿フォーム( https://www.decamail.jp/mail/nyukou.cgi?id= @<br>{}eeab6dedb54809d917c8f591ebb69b13&old=1 )より @<br>{} @<br>{}  ・ご使用のOSとソフト（必須） @<br>{} Windows（　　　　） @<br>{} Mac（　　　　） @<br>{} ・使用アプリケーションとバージョン
//}


=== 仕様を元にアイデア出し

//embed[latex]{
\talk{gontobob}{コミュニティの名前にPolarisって入ってるし、背景を星空にしてみたんだけどどう？}
//}

//indepimage[5_polaris_wip1][][scale=0.5]{
//}

//embed[latex]{
\talk{wiroha}{いいじゃん！あ、帯のキャッチコピーはこれにしてほしい（テキストを共有する）で、下の方に小さく掲載内容を並べてほしい。帯はそれで埋まると思うけど、空いてる真ん中に描く要素何かあるかな……？}
\talk{gontobob}{Polarisはこぐま座のα星ってところから連想して、こぐまのキャラクター、ってだけだと特徴つけるの難しいね。}
\talk{wiroha}{こぐま座のしっぽの星なんだ。めっちゃかわいいな！デフォルメの効いたかわいいキャラクターだと親しみやすくていいかも。}
\talk{gontobob}{OK、ちょっと練ってみようか。}
//}

//indepimage[5_idea1][][scale=0.6]{
//}

//embed[latex]{
\talk{wiroha}{かわいいこぐまのキャラクター、ってだけだと特徴つけるの難しいね。}
\talk{gontobob}{耳とか胸の模様とか、どこかに星要素入れてみたり？}
\talk{wiroha}{あとは技術系だからパソコン触ってたり本読んでたりするといいかも。}
\talk{gontobob}{うーんうーん……（耳に星がついたクマやしっぽが星になっているクマや柄杓を持ったクマのらくがきを量産しながら）}
//}

//indepimage[5_idea2][][scale=0.3]{
//}

//embed[latex]{
\talk{wiroha}{……あ！マフラーの先が星になってるのどうかな？！}
\talk{gontobob}{おっいいね！マフラーの色は希望ある？映えそうなのは赤だけど……}
\talk{wiroha}{コミュニティのイメージカラーからいくと紺かなぁ。}
\talk{gontobob}{なるほど。これでどうだろう。}
//}

//indepimage[5_rough][][scale=0.6]{
//}

//embed[latex]{
\talk{wiroha}{いいねいいね。裏表紙も表紙から繋げて星空にして、そこに執筆者と目次を入れたいな。ただ、締切まで目次が確定しないかもしれないから、仮テキストは流し込みつつそこまで待っててほしい。あ、あと本は右開きだからくまの向きは反対の方がいいかも。直してほしいとこに赤入れした画像送る。}
\talk{gontobob}{了解。}
//}

//indepimage[5_polaris_akaire_before_after][][scale=0.9]{
//}

=== 予期せぬ修正がはいること

//embed[latex]{
\talk{wiroha}{ごめん、執筆者の人数が減っちゃったから目次の内容が最初と変わる！}
\talk{gontobob}{まじか。そしたら行数も変わるから裏表紙のバランス取り直さないとだな……文字サイズとかいじってもいい？}
\talk{wiroha}{お願い〜。あとそれに合わせて帯に載せる内容もちょっと変わるんだけど、今日の19時〆で集約してるからそれまで待って！}
\talk{gontobob}{はーい。じゃあこっちは20時ぐらいから作業できるように準備しとくね。}
//}

=== といったやり取りを繰り返し、表紙データが完成！

//indepimage[5_complete][][scale=0.5]{
//}

//embed[latex]{
\talk{gontobob}{入稿データ一式アップしたよ。万が一入稿不備があったら連絡して。仕事が終わってからだから夕方以降になるけど。}
\talk{wiroha}{了解〜、助かった！}
//}

=== 感想がもらえると嬉しい！

//embed[latex]{
\talk{wiroha}{コミュニティのメンバーに表紙デザイン見せたらみんな喜んでたよ。くまのキャラクターとか星空のデザインとかイメージに合ってるって。}
\talk{gontobob}{やったぜ！感想ってなかなかデザイナーに届かないから、共有してもらえるとめっちゃ嬉しい～。皆さんにもよろしくお伝えください。}
//}

そして、技術書典14にて「Code Polaris Tech Book vol.1」が発行され、その後発行されたvol.2でもマフラーを巻いたクマのキャラクターが新たなポーズで表紙を飾ることになるのでした。
