
= おわりに

本書では、wirohaとgontobobが実際に表紙制作を依頼した際のプロセスを追いながら、どのような情報が必要で、どのようなコミュニケーションが円滑な進行に繋がるのかを整理しました。

各章を担当分けして執筆しましたが、わからないことは相互に聞き合って情報を補完しました。
依頼側と制作側、それぞれの立場だからこそ見えてくる細かなポイントを拾い上げ、より解像度の高いガイドとなることを目指しました。
本書の内容が、皆さんの楽しい本作りを支える一助となれば幸いです。最後まで読んでくださり、ありがとうございました。

==== 第1章・第2章 wiroha / @wiroha

エンジニア・プロダクトマネージャーを経て、いまは技術広報となりイベント会場によく出没している。技術書典には第1回から継続的に参加し、Androidや科学、VTuber、英語などそのとき興味のあるコンテンツを執筆してきた。表紙の猫は我が家の猫ちゃんがモデル。

==== 第3章・第4章・第5章 ボブのおえかき / @gontobob

自認：たぬきの駆け出しイラストレーター。まるっこくやさしいテイストのSDやミニキャライラストが得意。好きなモチーフはパーカーやスニーカーなどのファッション、食べ物や動物。ココナラ・メール等でイラストのお仕事を絶賛募集中。wirohaの姉だが、妹のほうがしっかりしているともっぱら評判。
